workloads/YCSB_rocksdb/luma_test_logs/record_size_workloadA_logs/ext4_8dev_512KB
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 83665
[OVERALL], Throughput(ops/sec), 478.09717325046313
[TOTAL_GCS_G1_Young_Generation], Count, 55
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 625
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7470268332038487
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 55
[TOTAL_GC_TIME], Time(ms), 625
[TOTAL_GC_TIME_%], Time(%), 0.7470268332038487
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 9257.8125
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 592383
[CLEANUP], 95thPercentileLatency(us), 21
[CLEANUP], 99thPercentileLatency(us), 24
[INSERT], Operations, 40000
[INSERT], AverageLatency(us), 132633.2684
[INSERT], MinLatency(us), 33472
[INSERT], MaxLatency(us), 4521983
[INSERT], 95thPercentileLatency(us), 100351
[INSERT], 99thPercentileLatency(us), 3067903
[INSERT], Return=OK, 40000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 35199
[OVERALL], Throughput(ops/sec), 1136.395920338646
[TOTAL_GCS_G1_Young_Generation], Count, 45
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 529
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.5028836046478593
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 45
[TOTAL_GC_TIME], Time(ms), 529
[TOTAL_GC_TIME_%], Time(%), 1.5028836046478593
[READ], Operations, 19892
[READ], AverageLatency(us), 9249.829177558817
[READ], MinLatency(us), 148
[READ], MaxLatency(us), 81855
[READ], 95thPercentileLatency(us), 19183
[READ], 99thPercentileLatency(us), 33055
[READ], Return=OK, 19892
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3736.25
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 238463
[CLEANUP], 95thPercentileLatency(us), 39
[CLEANUP], 99thPercentileLatency(us), 59
[UPDATE], Operations, 20108
[UPDATE], AverageLatency(us), 96920.0891187587
[UPDATE], MinLatency(us), 1594
[UPDATE], MaxLatency(us), 1215487
[UPDATE], 95thPercentileLatency(us), 119487
[UPDATE], 99thPercentileLatency(us), 488959
[UPDATE], Return=OK, 20108
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 43286
[OVERALL], Throughput(ops/sec), 924.0863096613224
[TOTAL_GCS_G1_Young_Generation], Count, 45
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 859
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.9844753499976897
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 45
[TOTAL_GC_TIME], Time(ms), 859
[TOTAL_GC_TIME_%], Time(%), 1.9844753499976897
[READ], Operations, 20011
[READ], AverageLatency(us), 11161.662985358053
[READ], MinLatency(us), 153
[READ], MaxLatency(us), 604159
[READ], 95thPercentileLatency(us), 26015
[READ], 99thPercentileLatency(us), 56479
[READ], Return=OK, 20011
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6951.765625
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 444415
[CLEANUP], 95thPercentileLatency(us), 26
[CLEANUP], 99thPercentileLatency(us), 45
[UPDATE], Operations, 19989
[UPDATE], AverageLatency(us), 120237.06978838361
[UPDATE], MinLatency(us), 1510
[UPDATE], MaxLatency(us), 1791999
[UPDATE], 95thPercentileLatency(us), 340735
[UPDATE], 99thPercentileLatency(us), 1060863
[UPDATE], Return=OK, 19989
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 46288
[OVERALL], Throughput(ops/sec), 864.1548565502939
[TOTAL_GCS_G1_Young_Generation], Count, 40
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 430
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.9289664707915658
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 40
[TOTAL_GC_TIME], Time(ms), 430
[TOTAL_GC_TIME_%], Time(%), 0.9289664707915658
[READ], Operations, 20059
[READ], AverageLatency(us), 9559.566429034348
[READ], MinLatency(us), 150
[READ], MaxLatency(us), 497407
[READ], 95thPercentileLatency(us), 20495
[READ], 99thPercentileLatency(us), 44767
[READ], Return=OK, 20059
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 5320.453125
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 339967
[CLEANUP], 95thPercentileLatency(us), 24
[CLEANUP], 99thPercentileLatency(us), 42
[UPDATE], Operations, 19941
[UPDATE], AverageLatency(us), 132974.3883957675
[UPDATE], MinLatency(us), 1783
[UPDATE], MaxLatency(us), 2805759
[UPDATE], 95thPercentileLatency(us), 180223
[UPDATE], 99thPercentileLatency(us), 1925119
[UPDATE], Return=OK, 19941
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 45895
[OVERALL], Throughput(ops/sec), 871.554635581218
[TOTAL_GCS_G1_Young_Generation], Count, 46
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 481
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.0480444492864147
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 46
[TOTAL_GC_TIME], Time(ms), 481
[TOTAL_GC_TIME_%], Time(%), 1.0480444492864147
[READ], Operations, 19697
[READ], AverageLatency(us), 8635.029801492614
[READ], MinLatency(us), 156
[READ], MaxLatency(us), 210047
[READ], 95thPercentileLatency(us), 19231
[READ], 99thPercentileLatency(us), 30959
[READ], Return=OK, 19697
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8328.03125
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 532479
[CLEANUP], 95thPercentileLatency(us), 27
[CLEANUP], 99thPercentileLatency(us), 43
[UPDATE], Operations, 20303
[UPDATE], AverageLatency(us), 129233.12402108063
[UPDATE], MinLatency(us), 1678
[UPDATE], MaxLatency(us), 2807807
[UPDATE], 95thPercentileLatency(us), 228863
[UPDATE], 99thPercentileLatency(us), 1565695
[UPDATE], Return=OK, 20303
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 50422
[OVERALL], Throughput(ops/sec), 793.304509936139
[TOTAL_GCS_G1_Young_Generation], Count, 46
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 511
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.0134465114434177
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 46
[TOTAL_GC_TIME], Time(ms), 511
[TOTAL_GC_TIME_%], Time(%), 1.0134465114434177
[READ], Operations, 19888
[READ], AverageLatency(us), 8680.569740547064
[READ], MinLatency(us), 146
[READ], MaxLatency(us), 150015
[READ], 95thPercentileLatency(us), 19439
[READ], 99thPercentileLatency(us), 41119
[READ], Return=OK, 19888
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 13222.984375
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 845311
[CLEANUP], 95thPercentileLatency(us), 51
[CLEANUP], 99thPercentileLatency(us), 88
[UPDATE], Operations, 20112
[UPDATE], AverageLatency(us), 143737.75790572792
[UPDATE], MinLatency(us), 1969
[UPDATE], MaxLatency(us), 4055039
[UPDATE], 95thPercentileLatency(us), 224255
[UPDATE], 99thPercentileLatency(us), 2002943
[UPDATE], Return=OK, 20112
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 34855
[OVERALL], Throughput(ops/sec), 1147.6115334959115
[TOTAL_GCS_G1_Young_Generation], Count, 43
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 593
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.7013340984076892
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 43
[TOTAL_GC_TIME], Time(ms), 593
[TOTAL_GC_TIME_%], Time(%), 1.7013340984076892
[READ], Operations, 19848
[READ], AverageLatency(us), 11480.312222893994
[READ], MinLatency(us), 152
[READ], MaxLatency(us), 106943
[READ], 95thPercentileLatency(us), 26175
[READ], 99thPercentileLatency(us), 38847
[READ], Return=OK, 19848
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 5343.25
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 341247
[CLEANUP], 95thPercentileLatency(us), 25
[CLEANUP], 99thPercentileLatency(us), 90
[UPDATE], Operations, 20152
[UPDATE], AverageLatency(us), 92155.89698292973
[UPDATE], MinLatency(us), 1708
[UPDATE], MaxLatency(us), 1006591
[UPDATE], 95thPercentileLatency(us), 132607
[UPDATE], 99thPercentileLatency(us), 245247
[UPDATE], Return=OK, 20152
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 63384
[OVERALL], Throughput(ops/sec), 631.0740880979426
[TOTAL_GCS_G1_Young_Generation], Count, 44
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1910
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 3.0133787706676762
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 44
[TOTAL_GC_TIME], Time(ms), 1910
[TOTAL_GC_TIME_%], Time(%), 3.0133787706676762
[READ], Operations, 19944
[READ], AverageLatency(us), 11566.014340152427
[READ], MinLatency(us), 146
[READ], MaxLatency(us), 1994751
[READ], 95thPercentileLatency(us), 17039
[READ], 99thPercentileLatency(us), 139391
[READ], Return=OK, 19944
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 7644.28125
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 488703
[CLEANUP], 95thPercentileLatency(us), 19
[CLEANUP], 99thPercentileLatency(us), 31
[UPDATE], Operations, 20056
[UPDATE], AverageLatency(us), 182987.77607698445
[UPDATE], MinLatency(us), 1571
[UPDATE], MaxLatency(us), 4370431
[UPDATE], 95thPercentileLatency(us), 421887
[UPDATE], 99thPercentileLatency(us), 3110911
[UPDATE], Return=OK, 20056
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 42893
[OVERALL], Throughput(ops/sec), 932.5530972419742
[TOTAL_GCS_G1_Young_Generation], Count, 41
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 514
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.198330729955937
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 41
[TOTAL_GC_TIME], Time(ms), 514
[TOTAL_GC_TIME_%], Time(%), 1.198330729955937
[READ], Operations, 20009
[READ], AverageLatency(us), 10408.471637763007
[READ], MinLatency(us), 148
[READ], MaxLatency(us), 481535
[READ], 95thPercentileLatency(us), 21311
[READ], 99thPercentileLatency(us), 85695
[READ], Return=OK, 20009
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 4861.765625
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 310527
[CLEANUP], 95thPercentileLatency(us), 25
[CLEANUP], 99thPercentileLatency(us), 68
[UPDATE], Operations, 19991
[UPDATE], AverageLatency(us), 119806.48962032914
[UPDATE], MinLatency(us), 1791
[UPDATE], MaxLatency(us), 1992703
[UPDATE], 95thPercentileLatency(us), 143487
[UPDATE], 99thPercentileLatency(us), 1223679
[UPDATE], Return=OK, 19991
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 40669
[OVERALL], Throughput(ops/sec), 983.5501241732031
[TOTAL_GCS_G1_Young_Generation], Count, 41
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 457
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1237060168678847
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 41
[TOTAL_GC_TIME], Time(ms), 457
[TOTAL_GC_TIME_%], Time(%), 1.1237060168678847
[READ], Operations, 19890
[READ], AverageLatency(us), 9935.291201608848
[READ], MinLatency(us), 146
[READ], MaxLatency(us), 138879
[READ], 95thPercentileLatency(us), 22175
[READ], 99thPercentileLatency(us), 44383
[READ], Return=OK, 19890
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 13183.671875
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 843263
[CLEANUP], 95thPercentileLatency(us), 34
[CLEANUP], 99thPercentileLatency(us), 49
[UPDATE], Operations, 20110
[UPDATE], AverageLatency(us), 112639.86668324217
[UPDATE], MinLatency(us), 1707
[UPDATE], MaxLatency(us), 1984511
[UPDATE], 95thPercentileLatency(us), 167807
[UPDATE], 99thPercentileLatency(us), 1078271
[UPDATE], Return=OK, 20110
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 53311
[OVERALL], Throughput(ops/sec), 750.3141940687663
[TOTAL_GCS_G1_Young_Generation], Count, 43
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 594
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.114216578192118
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 43
[TOTAL_GC_TIME], Time(ms), 594
[TOTAL_GC_TIME_%], Time(%), 1.114216578192118
[READ], Operations, 19987
[READ], AverageLatency(us), 9039.388252364037
[READ], MinLatency(us), 165
[READ], MaxLatency(us), 224511
[READ], 95thPercentileLatency(us), 20655
[READ], 99thPercentileLatency(us), 39263
[READ], Return=OK, 19987
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 10735.484375
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 686591
[CLEANUP], 95thPercentileLatency(us), 26
[CLEANUP], 99thPercentileLatency(us), 32
[UPDATE], Operations, 20013
[UPDATE], AverageLatency(us), 153087.72073152452
[UPDATE], MinLatency(us), 1733
[UPDATE], MaxLatency(us), 2859007
[UPDATE], 95thPercentileLatency(us), 676863
[UPDATE], 99thPercentileLatency(us), 1921023
[UPDATE], Return=OK, 20013
*---------------------------------- ycsb run end ------------------------------*
experiment end.